fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПолучитьДоговорыНаСервере()      
	
	Объект.СписокДоговоров.Очистить();	
	
	ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов(Объект.ВКМ_Период);
	
	Для Каждого Строка Из ДоговорыКонтрагентов Цикл
		
		Если ДоговорыКонтрагентов.Количество() > 0 Тогда  
			
			НоваяСтрока = Объект.СписокДоговоров.Добавить(); 
			НоваяСтрока.Договор = Строка.Договор;
			НоваяСтрока.Клиент = Строка.Клиент;
			
		КонецЕсли;	
		
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДоговоры(Команда)
	ПолучитьДоговорыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорыКонтрагентов(Период)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Договор,
        |	Контрагенты.Ссылка КАК Клиент
        |ИЗ
        |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
        |		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
        |	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &Период
        |			ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора = &Период)
        |	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &Период
        |			ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора = &Период)";  
	
	Запрос.УстановитьПараметр("Период", Период);          
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();  
	
    МассивДоговоров = Новый Массив;  
	    
	Пока Выборка.Следующий() Цикл  
		
		СтруктураДоговоров = Новый Структура;   
		
		СтруктураДоговоров.Вставить("Договор", Выборка.Договор); 
		СтруктураДоговоров.Вставить("Клиент", Выборка.Клиент); 
		
		МассивДоговоров.Добавить(СтруктураДоговоров);  
		 
	КонецЦикла;      	     
		
    Возврат МассивДоговоров;     
    
КонецФункции  

&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере(СписокДоговоров, ВыбранныйПериод)
		
	СоздатьРеализацииНаСервере = ДлительныеОперации.ВыполнитьФункцию(ЭтаФорма.УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьРеализацииНаСервере", СписокДоговоров, ВыбранныйПериод);
	
	Возврат СоздатьРеализацииНаСервере;
	
КонецФункции 

&НаКлиенте
Процедура ВКМ_СоздатьДокументы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
	    Сообщить("Не заполнен период"); 
	    Возврат; 
	КонецЕсли; 
	
	СписокДоговоров = ПолучитьДанныеДоговоров();
    ВыбранныйПериод = Объект.ВКМ_Период; 
	
	ЕстьРеализации = ПроверитьРеализациюНаПериод(ВыбранныйПериод);   
	
	 Если ЕстьРеализации Тогда
        Сообщить("Уже созданы реализации за этот период"); 
        Возврат;     
    КонецЕсли; 
		
	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере(СписокДоговоров, ВыбранныйПериод);  
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещаниеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещаниеОЗавершении,ПараметрыОжидания);
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьДанныеДоговоров() Экспорт
	
   СписокДоговоров = Объект.СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Договор");
	
   Возврат СписокДоговоров;	
	
КонецФункции

&НаСервере
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбщегоНазначения.СообщитьПользователю("Результат длительной операции: " + ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьРеализациюНаПериод(Период) 
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    РеализацияТоваровУслуг.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |    НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |    И РеализацияТоваровУслуг.Дата = &Дата";
    
    Запрос.УстановитьПараметр("Дата", Период);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Истина; 
    Иначе 
        Возврат Ложь; 
    КонецЕсли;
        
КонецФункции 

#КонецОбласти
